lib/tasks/migrate_from_go.rake

UPDATE "settings" SET "password_digest" = '$2a$10$Mnzl3HOJe9gGReV2oTTYaeZOCqVfdZxBBkR8rNGTNTZQ1ciuRI6Mq', "updated_at" = '2026-07-07 21:04:37.410584' WHERE "settings"."id" = 1
UPDATE "settings" SET "cloud_init_dir" = '/Users/iain/.passgo-web/cloud-init', "playbooks_dir" = '/Users/iain/.passgo-web/playbooks', "updated_at" = '2026-07-07 21:04:37.413045' WHERE "settings"."id" = 1
---
  task :migrate_from_go_config, %i[path] => :environment do |_task, args|
    path = args[:path] || File.expand_path("~/.passgo-web/config.json")

    unless File.exist?(path)
      abort "config.json not found at #{path}. Pass a path: " \
            "rails db:migrate_from_go_config[/path/to/config.json]"
    end

    cfg = JSON.parse(File.read(path))
    puts "→ Importing config from #{path}..."

    ActiveRecord::Base.transaction do
      # Settings (singleton row)
      setting = Setting.current
      setting.update!(
        username: cfg["username"] || "admin",
        # Bcrypt hashes are portable between Go and Ruby — copy verbatim.
        # has_secure_password will accept the $2b$... format.
        password_digest: cfg["password"]
      )
      setting.install_bcrypt_hash!(cfg["password"]) if cfg["password"].to_s.start_with?("$2")

      setting.update!(
        cloud_init_dir: cfg["cloud_init_dir"] || "",
        cloud_init_repo: cfg["cloud_init_repo"] || "",
        playbooks_dir: cfg["playbooks_dir"] || "",
        trust_proxy: cfg["trust_proxy"] || false
      )

UPDATE "vm_defaults" SET "disk_gb" = 16, "memory_mb" = 2048, "ssh_private_key" = '~/.ssh/ib_ssh', "ssh_public_key" = 'ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIA0wSRi83wxDgxdA8o34GOjYkjC/ck5UsvRO7q8vPqhs', "updated_at" = '2026-07-07 21:04:37.417808' WHERE "vm_defaults"."id" = 1
---
      # VM defaults
      if cfg["vm_defaults"]
        vm_defaults = VmDefault.current
        vm_defaults.update!(
          cpus: cfg["vm_defaults"]["cpus"] || 2,
          memory_mb: cfg["vm_defaults"]["memory_mb"] || 1024,
          disk_gb: cfg["vm_defaults"]["disk_gb"] || 8,
          ssh_public_key: cfg["vm_defaults"]["ssh_public_key"],
          ssh_private_key: cfg["vm_defaults"]["ssh_private_key"]
        )

INSERT INTO "groups" ("created_at", "name", "position", "updated_at") VALUES ('2026-07-07 21:04:37.435266', 'K8S', 0, '2026-07-07 21:04:37.435266') RETURNING "id", "created_at", "updated_at"
SELECT "groups".* FROM "groups" WHERE "groups"."name" = 'K8S' LIMIT 1
---

      # Groups + VM assignments
      cfg["groups"]&.each_with_index do |name, i|
        Group.find_or_create_by!(name:) { |g| g.position = i }

INSERT INTO "vm_assignments" ("created_at", "group_id", "is_template", "updated_at", "vm_name") VALUES ('2026-07-07 21:04:37.443211', NULL, TRUE, '2026-07-07 21:04:37.443211', 'rootplane-hello-01') RETURNING "id", "created_at", "updated_at"
SELECT "vm_assignments".* FROM "vm_assignments" WHERE "vm_assignments"."vm_name" = 'rootplane-hello-01' LIMIT 1
---
        VmAssignment.find_or_create_by!(vm_name:) { |a| a.group = group }
      end
      cfg["vm_templates"]&.each do |vm_name, _|
        VmAssignment.find_or_create_by!(vm_name:) { |a| a.is_template = true }

INSERT INTO "profiles" ("builtin", "cloud_init", "cpus", "created_at", "disk_gb", "group_name", "id_slug", "memory_mb", "name", "network", "playbook", "release", "updated_at") VALUES (FALSE, 'builtin:ansible-ready.yml', 4, '2026-07-07 21:04:37.449974', 32, NULL, 'devops', 4192, 'test', NULL, 'apt-update-upgrade.yml', '22.04', '2026-07-07 21:04:37.449974') RETURNING "id", "created_at", "updated_at"
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id_slug" = 'devops' LIMIT 1
---

      # Profiles
      cfg["profiles"]&.each do |p|
        Profile.find_or_create_by!(id_slug: p["id"]) do |profile|

INSERT INTO "api_tokens" ("created_at", "id_slug", "name", "prefix", "sha256_digest", "updated_at") VALUES ('2026-04-09 10:55:18', '40b5074453fa1b9e7b5c2b85ec9063d5', 'CICD', 'pgo_76a86b6e', '259bc918f362bfe70fac684d9717eac355f25b778b673a1b43cbceb074f3eb76', '2026-07-07 21:04:37.458990') RETURNING "id", "created_at", "updated_at"
SELECT "api_tokens".* FROM "api_tokens" WHERE "api_tokens"."id_slug" = '40b5074453fa1b9e7b5c2b85ec9063d5' LIMIT 1
---

      # API tokens
      cfg["api_tokens"]&.each do |t|
        ApiToken.find_or_create_by!(id_slug: t["id"]) do |token|

INSERT INTO "events" ("id", "action", "actor", "category", "created_at", "detail", "endpoint", "payload", "resource", "result", "updated_at") VALUES ('1775741884-b7e6fdfa', 'start', 'user', 'vm', '2026-04-09 13:38:04', NULL, NULL, NULL, 'ansible', 'success', '2026-07-07 21:04:37.468534') RETURNING "created_at", "updated_at"
---
        next if line.strip.empty?
        begin
          ev = JSON.parse(line)
          Event.find_or_create_by!(id: ev["id"]) do |e|

SELECT COUNT(*) FROM "groups"
SELECT COUNT(*) FROM "vm_assignments"
SELECT COUNT(*) FROM "profiles"
SELECT COUNT(*) FROM "schedules"
SELECT COUNT(*) FROM "api_tokens"
SELECT COUNT(*) FROM "webhooks"
SELECT COUNT(*) FROM "events"
---
    puts ""
    puts "✓ Migration complete."
    puts "  Username: #{Setting.current.username}"
    puts "  Groups:   #{Group.count}"
    puts "  VM assignments: #{VmAssignment.count}"
    puts "  Profiles: #{Profile.count}"
    puts "  Schedules: #{Schedule.count}"
    puts "  Tokens:   #{ApiToken.count}"
    puts "  Webhooks: #{Webhook.count}"
    puts "  Events:   #{Event.count}"