app/controllers/events_controller.rb

  def index
    @events = Event.order(created_at: :desc).limit(50)
---
SELECT "events".* FROM "events" ORDER BY "events"."created_at" DESC LIMIT 50