app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("id_slug", "name", "release", "cpus", "memory_mb", "disk_gb", "cloud_init", "network", "playbook", "group_name", "builtin", "created_at", "updated_at") VALUES ('web-server-2be0', 'web-server', '24.04', 2, 2048, 10, NULL, NULL, NULL, 'web', FALSE, '2026-07-07 20:45:33.072516', '2026-07-07 20:45:33.072516') RETURNING "id", "created_at", "updated_at"
---
  def create
    @profile = Profile.new(profile_params.merge(id_slug: generate_id_slug))
    if @profile.save