app/models/api_token.rb

  def self.issue!(name:)
    raise ActiveRecord::RecordInvalid, "name is required" if name.blank?
---
SELECT 1 AS one FROM "api_tokens" WHERE "api_tokens"."name" = 'CI automation' LIMIT 1